In [12]:
import pandas as pd

# reading csv file 
df = pd.read_csv(r"D:\Python_cat\people_data.csv") 

df

,First Name,Last Name,Sex,Email,Date of birth,Job Title
0,Shelby,Terrell,Male,elijah57@example.net,10/26/1945,Games developer
1,Phillip,Summers,Female,bethany14@example.com,3/24/1910,Phytotherapist
2,Kristine,Travis,Male,bthompson@example.com,7/2/1992,Homeopath
3,Yesenia,Martinez,Male,kaitlinkaiser@example.com,8/3/2017,Market researcher
4,Lori,Todd,Male,buchananmanuel@example.net,12/1/1938,Veterinary surgeon

In [ ]:
df = pd.read_csv("D:\Python_cat\people_data.csv", usecols=["First Name", "Email"])
print(df)

  First Name                       Email
0     Shelby        elijah57@example.net
1    Phillip       bethany14@example.com
2   Kristine       bthompson@example.com
3    Yesenia   kaitlinkaiser@example.com
4       Lori  buchananmanuel@example.net

In [14]:
df = pd.read_csv("D:\Python_cat\people_data.csv", index_col="First Name")
print(df)

           Last Name     Sex                       Email Date of birth  \
First Name
Shelby       Terrell    Male        elijah57@example.net    10/26/1945
Phillip      Summers  Female       bethany14@example.com     3/24/1910
Kristine      Travis    Male       bthompson@example.com      7/2/1992
Yesenia     Martinez    Male   kaitlinkaiser@example.com      8/3/2017
Lori            Todd    Male  buchananmanuel@example.net     12/1/1938

                     Job Title
First Name
Shelby         Games developer
Phillip         Phytotherapist
Kristine             Homeopath
Yesenia      Market researcher
Lori        Veterinary surgeon

In [15]:
df = pd.read_csv("D:\Python_cat\people_data.csv", na_values=["N/A", "Unknown"])

In [16]:
import pandas as pd

# Sample data stored in a multi-line string
data = """totalbill_tip, sex:smoker, day_time, size
16.99, 1.01:Female|No, Sun, Dinner, 2
10.34, 1.66, Male, No|Sun:Dinner, 3
21.01:3.5_Male, No:Sun, Dinner, 3
23.68, 3.31, Male|No, Sun_Dinner, 2
24.59:3.61, Female_No, Sun, Dinner, 4
25.29, 4.71|Male, No:Sun, Dinner, 4"""

# Save the data to a CSV file
with open("sample.csv", "w") as file:
    file.write(data)
print(data)

totalbill_tip, sex:smoker, day_time, size
16.99, 1.01:Female|No, Sun, Dinner, 2
10.34, 1.66, Male, No|Sun:Dinner, 3
21.01:3.5_Male, No:Sun, Dinner, 3
23.68, 3.31, Male|No, Sun_Dinner, 2
24.59:3.61, Female_No, Sun, Dinner, 4
25.29, 4.71|Male, No:Sun, Dinner, 4

In [17]:
# Load the CSV file using pandas with multiple delimiters
df = pd.read_csv('sample.csv',
                 sep='[:, |_]',  # Define the delimiters
                 engine='python')  # Use Python engine for regex separators
df

,totalbill,tip,Unnamed: 2,sex,smoker,Unnamed: 5,day,time,Unnamed: 8,size
16.99,NaN,1.01,Female,No,NaN,Sun,NaN,Dinner,NaN,2.0
10.34,NaN,1.66,NaN,Male,NaN,No,Sun,Dinner,NaN,3.0
21.01,3.50,Male,NaN,No,Sun,NaN,Dinner,NaN,3.0,NaN
23.68,NaN,3.31,NaN,Male,No,NaN,Sun,Dinner,NaN,2.0
24.59,3.61,NaN,Female,No,NaN,Sun,NaN,Dinner,NaN,4.0
25.29,NaN,4.71,Male,NaN,No,Sun,NaN,Dinner,NaN,4.0

In [18]:
df = pd.read_csv('D:\Python_cat\people_data.csv', nrows=3)
df

,First Name,Last Name,Sex,Email,Date of birth,Job Title
0,Shelby,Terrell,Male,elijah57@example.net,10/26/1945,Games developer
1,Phillip,Summers,Female,bethany14@example.com,3/24/1910,Phytotherapist
2,Kristine,Travis,Male,bthompson@example.com,7/2/1992,Homeopath

In [21]:
df= pd.read_csv("D:\Python_cat\people_data.csv")
print("Previous Dataset: ")
print(df)
# using skiprows
df = pd.read_csv("D:\Python_cat\people_data.csv", skiprows = [4,5])
print("Dataset After skipping rows: ")
print(df)

Previous Dataset:
  First Name Last Name     Sex                       Email Date of birth  \
0     Shelby   Terrell    Male        elijah57@example.net    10/26/1945
1    Phillip   Summers  Female       bethany14@example.com     3/24/1910
2   Kristine    Travis    Male       bthompson@example.com      7/2/1992
3    Yesenia  Martinez    Male   kaitlinkaiser@example.com      8/3/2017
4       Lori      Todd    Male  buchananmanuel@example.net     12/1/1938

            Job Title
0     Games developer
1      Phytotherapist
2           Homeopath
3   Market researcher
4  Veterinary surgeon
Dataset After skipping rows:
  First Name Last Name     Sex                  Email Date of birth  \
0     Shelby   Terrell    Male   elijah57@example.net    10/26/1945
1    Phillip   Summers  Female  bethany14@example.com     3/24/1910
2   Kristine    Travis    Male  bthompson@example.com      7/2/1992

         Job Title
0  Games developer
1   Phytotherapist
2        Homeopath

In [22]:
df = pd.read_csv("D:\Python_cat\people_data.csv", parse_dates=["Date of birth"])
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   First Name     5 non-null      object
 1   Last Name      5 non-null      object
 2   Sex            5 non-null      object
 3   Email          5 non-null      object
 4   Date of birth  5 non-null      datetime64[ns]
 5   Job Title      5 non-null      object
dtypes: datetime64[ns](1), object(5)
memory usage: 368.0+ bytes
None

In [28]:
#df.head()
#df.tail()
df.shape

(5, 6)

In [29]:
df.columns

Index(['First Name', 'Last Name', 'Sex', 'Email', 'Date of birth',
       'Job Title'],
      dtype='object')

In [30]:
df.size

30

In [31]:
df.dtypes

First Name               object
Last Name                object
Sex                      object
Email                    object
Date of birth    datetime64[ns]
Job Title                object
dtype: object

In [32]:
df.values

array([['Shelby', 'Terrell', 'Male', 'elijah57@example.net',
        Timestamp('1945-10-26 00:00:00'), 'Games developer'],
       ['Phillip', 'Summers', 'Female', 'bethany14@example.com',
        Timestamp('1910-03-24 00:00:00'), 'Phytotherapist'],
       ['Kristine', 'Travis', 'Male', 'bthompson@example.com',
        Timestamp('1992-07-02 00:00:00'), 'Homeopath'],
       ['Yesenia', 'Martinez', 'Male', 'kaitlinkaiser@example.com',
        Timestamp('2017-08-03 00:00:00'), 'Market researcher'],
       ['Lori', 'Todd', 'Male', 'buchananmanuel@example.net',
        Timestamp('1938-12-01 00:00:00'), 'Veterinary surgeon']],
      dtype=object)

In [33]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [36]:
url = "https://media.geeksforgeeks.org/wp-content/uploads/20241121154629307916/people_data.csv"
df = pd.read_csv(url)
df

,First Name,Last Name,Sex,Email,Date of birth,Job Title
0,Shelby,Terrell,Male,elijah57@example.net,1945-10-26,Games developer
1,Phillip,Summers,Female,bethany14@example.com,1910-03-24,Phytotherapist
2,Kristine,Travis,Male,bthompson@example.com,1992-07-02,Homeopath
3,Yesenia,Martinez,Male,kaitlinkaiser@example.com,2017-08-03,Market researcher
4,Lori,Todd,Male,buchananmanuel@example.net,1938-12-01,Veterinary surgeon

In [39]:
# importing pandas as pd
import pandas as pd

# list of name, degree, score
nme = ["aparna", "pankaj", "sudhir", "Geeku"]
deg = ["MBA", "BCA", "M.Tech", "MBA"]
scr = [90, 40, 80, 98]

# dictionary of lists
dict = {'name': nme, 'degree': deg, 'score': scr}
    
df = pd.DataFrame(dict)

In [40]:
# saving the dataframe
df.to_csv('file1.csv')

In [41]:
# saving the dataframe
df.to_csv('file2.csv', header=False, index=False)

In [35]:
import numpy as np 
list1 =[10,20,30,40,50]
array1=np.array(list1)
print(array1)
type(array1)

[10 20 30 40 50]

numpy.ndarray